# HemisphericalLightDistribution Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HemisphericalLightDistribution Constructor
HemisphericalLightDistribution Class See Also
---
Creates a hemispherical light distribution object.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public HemisphericalLightDistribution()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
HemisphericalLightDistribution()
```

# See Also
HemisphericalLightDistribution Class
HemisphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace